<!--
2. Задачи на написание линейных алгоритмов (переменные, арифметические операции, вывод на экран).

a) посчитать и вывести на экран чему равен периметр четырехугольника. Стороны четырехугольника могут быть любые. Необходимо сделать/нарисовать сначала блок-схему, затем воспроизвести блок-схему в коде на php.

				Данные для самопроверки

		Входные данные		| 			Выходные данные
	a=5,  b=3, c=5, d=11	|				p=24
	a=1,  b=2, c=3, d=5		|				p=11
	a=3,  b=4, c=2, d=8		|				p=17

 -->
<?php 
$p = a + b + c + d;
print($p);