<!--
3. Задачи на написание вариативных алгоритмов (if...else)

b. Доработать предыдущую задачу добавив проверку корректности вводимых данных пользователем. Если данные введены некорректно, то сообщить об этом и не производить расчеты.
Подсказка: для проверки корректности вводимых данных, рекомендуется сравнить введенное значение и вычисленное значение высоты.

                                Данные для самопроверки
                (a и с - боковые стороны, b и d - паралллельные стороны, h-высота)

        Входные данные                   |           Выходные данные
    why=true, a=5,  b=4, c=5, d=10 h=4   |               s=20
    why=false, a=5,  b=4, c=5, d=10 h=4  |               p=24
    why=false, a=5,  b=4, c=7, d=9 h=4   | "Ошибка введите корректные данные"

    -->

<?php