<?php
// создаем общую базу данных для сайта
$database = [
  // первый массив, названиe базы данных
  'pages' => [
    // второй массив необходимые значения, которые будем изменять
    [
      'title' => 'Главная страница сайта бытовок',
      'url_key' => '/index.php',
      'tpl' => 'main.php',
      'text' => ''
    ],
    [
      'title' => 'Каталог бытовок',
      'url_key' => '/catalog.php',
      'tpl' => 'catalog_tpl.php',
      'text' => 'Каталог'
    ],
    [
      'title' => 'Наши контакты',
      'url_key' => '/contacts.php',
      'tpl' => 'contacts_tpl.php',
      'text' => 'Контакты'
    ],
    [
      'title' => 'Доставка',
      'url_key' => '/delivery.php',
      'tpl' => 'delivery_tpl.php',
      'text' => 'Доставка'
    ],
    [
      'title' => 'Фотографии',
      'url_key' => '/photogallery.php',
      'tpl' => 'photogallery_tpl.php',
      'text' => 'Фотогалерея'
    ],
    [
      'title' => 'Цены',
      'url_key' => '/price.php',
      'tpl' => 'price_tpl.php',
      'text' => 'Цены'
    ],
    [
      'title' => 'Определённая бытовка',
      'url_key' => '/bytovka.php',
      'tpl' => 'bytovka_tpl.php',
      'text' => 'Бытовка'
    ]
  ],
  'category' => [
    [
      'id' => 1,
      'title' => 'Аренда бытовок в Видном',
      'name' => 'Аренда бытовок в Видном'
    ],
    [
      'id' => 2,
      'title' => 'Аренда бытовок в Домодедово',
      'name' => 'Аренда бытовок в Домодедово'
    ]
  ],
  'item' => [
    [
      'id' => 1,
      'title' => 'Блок контейнер 2,5 x 6 м',
      'name' => 'Блок контейнер 2,5 x 6 м',
      'price' => '1000'
    ],
    [
      'id' => 2,
      'title' => 'Бытовка раздевалка 2 x 3 м',
      'name' => 'Бытовка раздевалка 2 x 3 м',
      'price' => '600'
    ],
    [
      'id' => 3,
      'title' => 'Бытовка склад 3000 x 6000 см',
      'name' => 'Бытовка склад 3000 x 6000 см',
      'price' => '1200'
    ],
    [
      'id' => 4,
      'title' => 'Бытовка пост-охраны 2 x 2 м',
      'name' => 'Бытовка пост-охраны 2 x 2 м',
      'price' => '1000'
    ],
    [
      'id' => 5,
      'title' => 'Бытовка жилая 3 x 6 м',
      'name' => 'Бытовка жилая 3 x 6 м',
      'price' => '1500'
    ]
  ],
  'bytovka-list' => [
    [
    'id' => 1,
    'title' => 'Бытовка  склад',
    'size' => '2400 X 6000',
    'price' => 6000
    ],
    [
    'id' => 2,
    'title' => 'Бытовка прорабская(офис)',
    'size' => '2400 X 6000',
    'price' => 6000
    ],
    [
    'id' => 3,
    'title' => 'Бытовка  жилая',
    'size' => '2400 X 6000',
    'price' => 8000
    ],
    [
    'id' => 4,
    'title' => 'Бытовка  раздевалка',
    'size' => '2000 X 3000',
    'price' => 4500
    ],
    [
    'id' => 5,
    'title' => 'Бытовка  контейнер',
    'size' => '2500 X 6000',
    'price' => 'По запросу'
    ]
  ],
  'photogallery' => [
    [
      'address' => 'photo1.jpg',
      'name' => 'Погрузка'
    ],
    [
      'address' => 'photo2.jpg',
      'name' => 'Бытовка на бытовке'
    ],
    [
      'address' => 'photo3.jpg',
      'name' => 'Бытовка охраны'
    ],
    [
      'address' => 'photo4.jpg',
      'name' => 'Бытовка охраны'
    ],
    [
      'address' => 'photo5.jpg',
      'name' => 'бытовка внутри'
    ],
    [
      'address' => 'photo22.jpg',
      'name' => 'Пол внутри бытовки'
    ]
  ],
  'gallery' => [
    [
      'address' => 'gallery.jpg',
      'name' => 'Склады'
    ]
  ],
  'main-slider' => [
    [
      'url' => 'bytovka1.png',
      'description' => ''
    ],
    [
      'url' => 'bytovka2.png',
      'description' => 'Компания "Бытовки-Сервис" предлагает взять в аренду бытовку для жилья'
    ],
    [
      'url' => 'bytovka3.png',
      'description' => 'Компания "Бытовки-Сервис" предлагает взять в аренду бытовку пост-охраны'
    ],
    [
      'url' => 'bytovka4.png',
      'description' => 'Компания "Бытовки-Сервис" предлагает взять в аренду бытовку под склад'
    ],
    [
      'url' => 'bytovka5.png',
      'description' => 'Компания "Бытовки-Сервис" предлагает взять в аренду офисную бытовку'
    ],
    [
      'url' => 'bytovka6.png',
      'description' => 'Компания "Бытовки-Сервис" предлагает взять в аренду бытовку-раздевалку'
    ]
  ]
];